---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.SpaceSet.Erase(Autodesk.Revit.DB.Mechanical.Space)
source: html/00e0175c-aa17-1f40-ac65-983d6cdff06c.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSet.Erase Method

## Syntax (C#)
```csharp
public virtual int Erase(
	Space item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Mechanical.Space`)